Revit 2027 API
Opening.IsTransparentIn3D Property
Indicates if the opening is transparent in 3D view when loaded into the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTransparentIn3D { get; set; }
Public Property IsTransparentIn3D As Boolean
	Get
	Set
public:
property bool IsTransparentIn3D {
	bool get ();
	void set (bool value);
}
member IsTransparentIn3D : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when access this property in an opening belonging to a Revit project document.
Remarks
This property is only valid in Revit family documents.
See Also
Reference
Opening Class
Autodesk.Revit.DB Namespace